/* 菜单项目和窗口标题 */
"NINE_BOX_VIEW" = "九宫格预览 Pro";

/* 参考字符形区域 */
"REFERENCE_INPUT_PLACEHOLDER" = "输入参考字符形…";
"SAVE_REFERENCE_BUTTON" = "保存";
"SAVE_REFERENCE_TOOLTIP" = "保存到参考字组";

/* 主题切换按钮 */
"THEME_TOGGLE_LIGHT_TOOLTIP" = "切换至暗色模式";
"THEME_TOGGLE_DARK_TOOLTIP" = "切换至浅色模式";

/* 参考字面板切换按钮 */
"REFERENCE_PANEL_SHOW_TOOLTIP" = "显示参考字面板";
"REFERENCE_PANEL_HIDE_TOOLTIP" = "隐藏参考字面板";

/* 参考字窗口标题 */
"REFERENCE_PANEL_TITLE" = "参考字";

/* 锁定字窗口标题*/
"LOCKED_PANEL_TITLE" = "锁定字";

/* 字组面板切换按钮*/
"PRESETS_TOGGLE_SHOW_TOOLTIP" = "显示字组面板";
"PRESETS_TOGGLE_HIDE_TOOLTIP" = "隐藏字组面板";

/* 字组窗口标题*/
"PRESETS_WINDOW_TITLE" = "字组";

/* 模糊滑杆 */
"BLUR_SLIDER_TOOLTIP" = "模糊程度";

/* 字符形选择器 */
"GLYPH_PICKER_TITLE_LOCK" = "选择锁定字符形";
"GLYPH_PICKER_TITLE_REFERENCE" = "选择参考字符形";

/* 右键菜单（参考字输入区） */
"CONTEXT_MENU_GLYPH_PICKER" = "字符形选择器…";

/* 标题栏菜单按钮*/
"TITLEBAR_MENU_TOOLTIP" = "菜单";

/* 信息菜单*/
"INFO_MENU_HELP" = "使用说明";
"INFO_MENU_WEBSITE" = "官方网站";
"INFO_MENU_FEEDBACK" = "意见反馈…";
"INFO_MENU_CONTACT_US" = "联系我们…";
"INFO_MENU_TESTIMONIAL" = "分享使用心得…";
"INFO_MENU_PURCHASE" = "购买…";

/* 锁定切换按钮（主窗口工具栏） */
"LOCK_TOGGLE_ENABLED_TOOLTIP" = "锁定字符形已显示（按住 Cmd 编辑）";
"LOCK_TOGGLE_DISABLED_TOOLTIP" = "锁定字符形已隐藏（按住 Cmd 编辑）";

/* 锁定字面板*/
"CLEAR_LOCKED_BUTTON" = "清除";
"CLEAR_LOCKED_TOOLTIP" = "清除所有锁定字";
"SAVE_LOCKED_BUTTON" = "保存";
"SAVE_LOCKED_TOOLTIP" = "保存到锁定字组";
"LOCKED_PANEL_TOGGLE_SHOW" = "显示锁定字面板";
"LOCKED_PANEL_TOGGLE_HIDE" = "隐藏锁定字面板";

/* 参考字符形输入对话框 */
"REFERENCE_INPUT_CANCEL" = "取消";

/* 拖曳提示 */
"Open Grid in New Tab" = "在新标签页打开九宫格";

/* 工具栏切换按钮 */
"TOOLBAR_TOGGLE_HIDE_TOOLTIP" = "隐藏工具栏";
"TOOLBAR_TOGGLE_SHOW_TOOLTIP" = "显示工具栏";

/* 授权状态 */
"LICENSE_TRIAL_REMAINING" = "试用期：剩余 %ld 天";
"LICENSE_TRIAL_DAYS" = "剩余 %ld 天";
"LICENSE_ACTIVATED" = "授权给：%@";

/* 授权输入对话框 */
"LICENSE_INPUT_TITLE" = "激活授权";
"LICENSE_INPUT_CANCEL" = "取消";
"LICENSE_INPUT_BUY" = "购买…";
"LICENSE_INPUT_CONTACT" = "联系客服";

/* 授权拖放区域 */
"LICENSE_DROP_HINT" = "将 .license 文件拖放到此处";
"LICENSE_DROP_ACTIVE" = "释放以激活授权";

/* 授权错误消息 */
"LICENSE_ERROR_INVALID_KEY" = "序列号无效。";
"LICENSE_ERROR_INVALID_EMAIL" = "无效的电子邮件。";
"LICENSE_ERROR_INVALID_FILE" = "无效的授权文件。";
"LICENSE_ERROR_WRONG_PRODUCT" = "此授权不适用于 NineBoxView。";
"LICENSE_ERROR_MISSING_FIELDS" = "授权文件不完整。";
"LICENSE_ERROR_REVOKED" = "此序列号已被吊销。";
"LICENSE_VERIFYING" = "正在验证授权...";

/* 授权激活成功 */
"LICENSE_ACTIVATION_SUCCESS_TITLE" = "授权激活成功";
"LICENSE_ACTIVATION_SUCCESS_OK" = "好";

/* 试用期过期画面 */
"LICENSE_EXPIRED_WINDOW_TITLE" = "九宫格预览 Pro";
"LICENSE_EXPIRED_TITLE" = "试用期已结束";
"LICENSE_EXPIRED_MESSAGE" = "您的 14 天试用期已结束。\n请购买授权以继续使用九宫格预览 Pro。";
"LICENSE_EXPIRED_PURCHASE" = "购买授权";
"LICENSE_EXPIRED_ENTER_KEY" = "输入序列号";
"LICENSE_EXPIRED_FREE_VERSION" = "使用免费版";

/* 信息菜单*/
"INFO_MENU_ENTER_LICENSE" = "输入授权码…";

/* 欢迎对话框 */
"LICENSE_WELCOME_TITLE" = "欢迎使用九宫格预览 Pro";
"LICENSE_WELCOME_MESSAGE" = "体验强大的九宫格预览功能，帮助您做出更好的字符形设计决策。\n\n点击下方按钮后，您的 14 天免费试用期将正式开始。";
"LICENSE_WELCOME_START_TRIAL" = "开始 14 天试用";
"LICENSE_WELCOME_ENTER_KEY" = "输入序列号";

/* 控制面板分页*/
"PALETTE_TAB_REFERENCE" = "参考";
"PALETTE_TAB_LOCKED" = "锁定";

/* 控制面板右键菜单*/
"PALETTE_MENU_PIN" = "固定";
"PALETTE_MENU_UNPIN" = "取消固定";
"PALETTE_MENU_RENAME" = "重命名…";
"PALETTE_MENU_OVERWRITE" = "以当前替换";
"PALETTE_MENU_DELETE" = "删除";

/* 控制面板右键菜单 - 多选*/
"PALETTE_MENU_DELETE_MULTIPLE" = "删除 %lu 个项目";
"PALETTE_MENU_PIN_MULTIPLE" = "固定 %lu 个项目";
"PALETTE_MENU_UNPIN_MULTIPLE" = "取消固定 %lu 个项目";

/* 控制面板空状态*/
"PALETTE_EMPTY_REFERENCE" = "尚无参考字组\n+ 添加";
"PALETTE_EMPTY_LOCKED" = "尚无锁定字组\n+ 添加";

/* 控制面板覆盖确认*/
"PALETTE_OVERWRITE_CONFIRM_TITLE" = "确认覆盖";
"PALETTE_OVERWRITE_CONFIRM_MESSAGE" = "这将替换字组内容，无法撤销。";
"PALETTE_OVERWRITE_CONFIRM_OK" = "覆盖";

/* 九宫格右键菜单*/
"CONTEXT_MENU_SHOW_REFERENCE_INPUT" = "显示参考字面板";
"CONTEXT_MENU_HIDE_REFERENCE_INPUT" = "隐藏参考字面板";
"CONTEXT_MENU_SHOW_LOCKED_PANEL" = "显示锁定字面板";
"CONTEXT_MENU_HIDE_LOCKED_PANEL" = "隐藏锁定字面板";
"CONTEXT_MENU_SHOW_PRESETS" = "显示字组面板";
"CONTEXT_MENU_HIDE_PRESETS" = "隐藏字组面板";
"CONTEXT_MENU_SHOW_TOOLBAR" = "显示工具栏";
"CONTEXT_MENU_HIDE_TOOLBAR" = "隐藏工具栏";
"CONTEXT_MENU_LIGHT_MODE" = "浅色模式";
"CONTEXT_MENU_DARK_MODE" = "暗色模式";
/* 网格（Issue #422） */
"CONTEXT_MENU_SHOW_GRID_LINES" = "显示网格";
"CONTEXT_MENU_HIDE_GRID_LINES" = "隐藏网格";
"CONTEXT_MENU_GRID_STYLE" = "网格样式";
"GRID_STYLE_FIELD" = "田字格";
"GRID_STYLE_ASTERISK" = "米字格";
"GRID_STYLE_HASH" = "井字格";
/* 网格工具栏按钮（Option+点击：设置）*/
"GRID_TOGGLE_SHOW_TOOLTIP" = "显示网格（Option：设置）";
"GRID_TOGGLE_HIDE_TOOLTIP" = "隐藏网格（Option：设置）";
/* 回字格（Issue #435）*/
"CONTEXT_MENU_SHOW_COUNTER_FRAME" = "显示字面框";
"CONTEXT_MENU_HIDE_COUNTER_FRAME" = "隐藏字面框";
"CONTEXT_MENU_GRID_SETTINGS" = "网格设置…";
"GRID_STYLE_LABEL" = "样式";
"COUNTER_FRAME_LABEL" = "字面框";

/* 九宫格右键菜单 - 字符操作*/
"CONTEXT_MENU_INSERT_AT_CURSOR" = "插入当前标签页";
"CONTEXT_MENU_OPEN_IN_NEW_TAB" = "在新标签页中打开";

/* 导入/导出菜单*/
"PRESETS_MENU_IMPORT" = "导入…";
"PRESETS_MENU_EXPORT_SELECTED" = "导出选中字组…";
"PRESETS_MENU_EXPORT_ALL" = "导出所有字组…";

/* 导入模式对话框*/
"PRESETS_IMPORT_MODE_TITLE" = "导入字组";
"PRESETS_IMPORT_MODE_MESSAGE" = "发现 %lu 个字组。要如何导入？";
"PRESETS_IMPORT_MODE_APPEND" = "追加";
"PRESETS_IMPORT_MODE_REPLACE" = "全部替换";

/* 导入错误*/
"PRESETS_IMPORT_ERROR_TITLE" = "导入失败";
"PRESETS_IMPORT_ERROR_INVALID_FORMAT" = "文件格式无效。";
"PRESETS_IMPORT_ERROR_UNSUPPORTED_VERSION" = "此文件由较新版本创建，请更新插件。";
"PRESETS_IMPORT_ERROR_TYPE_MISMATCH" = "此文件包含%@字组，但您当前在%@标签页。";
"PRESETS_IMPORT_ERROR_EMPTY" = "此文件中没有有效的字组。";

/* 导出错误*/
"PRESETS_EXPORT_ERROR_TITLE" = "导出失败";
"PRESETS_EXPORT_ERROR_MESSAGE" = "无法保存文件：%@";

/* 类型名称*/
"PRESETS_TYPE_REFERENCE" = "参考字";
"PRESETS_TYPE_LOCKED" = "锁定字";

/* 搜索栏位 placeholder*/
"SEARCH_PRESETS_PLACEHOLDER" = "搜索字组…";
"SEARCH_NO_RESULTS" = "无结果";

/* 排序选项*/
"SORT_NAME_AZ" = "名称 A → Z";
"SORT_NAME_ZA" = "名称 Z → A";
"SORT_DATE_NEWEST" = "添加日期（新→旧）";
"SORT_DATE_OLDEST" = "添加日期（旧→新）";

/* 排序按钮提示*/
"SORT_BUTTON_TOOLTIP" = "排序方式";

/* 关于窗口*/
"ABOUT_MENU_ITEM" = "关于九宫格预览 Pro…";
"ABOUT_WINDOW_TITLE" = "关于";
"ABOUT_LICENSED_TO" = "授权给：";
"ABOUT_LINK_WEBSITE" = "官方网站";
"ABOUT_LINK_HELP" = "使用说明";
"ABOUT_TRIAL_STATUS" = "试用中";
"ABOUT_TRIAL_EXPIRED" = "试用过期";
"ABOUT_STATUS_LICENSED" = "已授权";
"ABOUT_STATUS_UNLICENSED" = "未授权";

/* 清除授权*/
"ABOUT_DEACTIVATE_LICENSE" = "清除授权";
"ABOUT_DEACTIVATE_CONFIRM_TITLE" = "确定要清除授权？";
"ABOUT_DEACTIVATE_CONFIRM_MESSAGE" = "授权信息将从这台电脑移除。您可以随时使用序列号重新激活。";
"ABOUT_DEACTIVATE_CONFIRM_OK" = "清除";
"ABOUT_DEACTIVATE_CONFIRM_CANCEL" = "取消";
